load-test-local.yaml
config:
  target: http://localhost:3001
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 30
    - duration: 30
      arrivalRate: 30
scenarios:
  - flow:
      #Most likely scenario, list products with default page/count
      # - loop:
      #     - get:
      #         url: /products/
      #   count: 100
      #Most likely scenario, get product with default page/count
      # - loop:
      #     - get:
      #         url: /products/{{$randomNumber(1,1000000)}}
      #   count: 50
      #Most likely scenario, get product style with default page/count
      # - loop:
      #     - get:
      #         url: /products/{{$randomNumber(1,1000000)}}/styles
      #   count: 50
      #Most likely scenario, get related products with default page/count
      - loop:
          - get:
              url: /products/{{$randomNumber(1,1000000)}}/related
        count: 50